//        Дана скобочная последовательность: [((())(())]]
//        - Можно ли считать эту последовательность правильной?  - НЕТ
//        - Если ответ на предыдущий вопрос “нет” - то что необходимо в ней изменить, чтоб она стала правильной?
//          ответ: Скобки должны сначала открываться, а потом закрываться, никак иначе. Внутри квадратных скобок одна лишняя квадратная
//                                           было [((())(())]]
//                                          стало [((())(()))]
//

public class Task4 {
}
